pcolefreeman/GlassHouse/JackNewest/firmware/coordinator/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
CONFIG_LWIP_MAX_SOCKETS=8
# Note: Console baud stays at default 115200 for readable ESP_LOG output.
# Data UART (UART1) baud is set in code at 921600.
